INSERT INTO worker (name, birthday, level, salary)
VALUES ('Іван Іванов', 1985, 'Trainee', 950),
       ('Петро Петренко', 1990, 'Junior', 1500),
       ('Олена Оленова', 1988, 'Middle', 3000),
       ('Сергій Сергієнко', 1982, 'Senior', 6000),
       ('Марія Марієнко', 1995, 'Trainee', 900),
       ('Андрій Андрієнко', 1987, 'Junior', 2000),
       ('Катерина Катериненко', 1992, 'Middle', 3500),
       ('Олег Олегов', 1980, 'Senior', 7000),
       ('Галина Галиніна', 1991, 'Middle', 2800),
       ('Тарас Тарасенко', 1983, 'Senior', 5500);

INSERT INTO client (name)
VALUES ('Клієнт 1'),
       ('Клієнт 2'),
       ('Клієнт 3'),
       ('Клієнт 4'),
       ('Клієнт 5');

INSERT INTO project (start_date, finish_date, client_id)
VALUES ('2021-01-01', '2021-12-01', 1), -- 11 місяців
       ('2020-02-01', '2020-03-01', 2), -- 1 місяць
       ('2019-05-01', '2020-05-01', 3), -- 12 місяців
       ('2018-01-01', '2020-01-01', 4), -- 24 місяці
       ('2017-01-01', '2025-01-01', 5), -- 96 місяців
       ('2022-01-01', '2023-06-01', 1), -- 17 місяців
       ('2020-06-01', '2021-06-01', 2), -- 12 місяців
       ('2018-03-01', '2020-03-01', 3), -- 24 місяці
       ('2015-01-01', '2017-06-01', 4), -- 30 місяців
       ('2016-06-01', '2017-06-01', 5); -- 12 місяців

INSERT INTO project_worker (project_id, worker_id)
VALUES (1, 1),
       (1, 2),
       (1, 3),
       (2, 4),
       (2, 5),
       (3, 6),
       (3, 7),
       (4, 8),
       (4, 9),
       (4, 10),
       (5, 1),
       (5, 2),
       (5, 3),
       (6, 4),
       (6, 5),
       (7, 6),
       (7, 7),
       (8, 8),
       (9, 9),
       (10, 10),
       (10, 1),
       (10, 2),
       (10, 3),
       (10, 4),
       (10, 5);


